{
  "backend/main.mo": "Main actor for the StoryWave backend, handling user profiles, story CRUD, likes, saves, AI story draft generation, and access control using mixins for storage and authorization.",
  "backend/migration.mo": "Migration module that upgrades the actor state by adding a new `storyDrafts` map (Principal → StoryDraft) to the existing state shape.",
  "feature_evidence.json": "Feature evidence report linking the AI Generate Story flow feature to its implementing frontend files and associated test ID REQ-11.",
  "frontend-file-summaries.txt": "Text file containing short summaries of the four key frontend files involved in the AI story generation feature.",
  "frontend/index.css": "Global CSS file that sets up Tailwind directives and defines light/dark mode CSS custom properties for the design system.",
  "frontend/index.html": "HTML entry point for the StoryWave frontend, mounting the React app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that defines the TanStack Router route tree for all app pages (Onboarding, Home, Search, Create, Library, Profile) wrapped in a PlayerProvider.",
  "frontend/src/components/audio/FullScreenAudioPlayer.tsx": "Full-screen audio player component that streams story audio, supports play/pause, seek, skip, and playback speed controls, and tracks view counts and recently played stories.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button component that uses Internet Identity for authentication and clears the React Query cache on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog shown to newly authenticated users to set up their username, bio, and profile picture URL before using the app.",
  "frontend/src/components/layout/AppLayout.tsx": "Root layout component that renders a desktop sidebar with navigation links, a mobile header, bottom navigation, a profile setup modal, and a full-screen audio player overlay.",
  "frontend/src/components/layout/BottomNavigation.tsx": "Mobile-only fixed bottom navigation bar with five icon+label links (Home, Search, Create, Library, Profile) that highlights the active route.",
  "frontend/src/components/profile/ProfileEditForm.tsx": "Form component for editing a user's profile (username, bio, profile picture URL) that submits changes via the saveCallerUserProfile mutation and shows a brief 'Saved!' confirmation.",
  "frontend/src/components/search/CategoryFilter.tsx": "Horizontally scrollable pill-button filter bar that lets users select or deselect a story category, with an 'All' option to clear the selection.",
  "frontend/src/components/search/SearchBar.tsx": "Controlled text input with a search icon and a clear (X) button used for searching stories or creators.",
  "frontend/src/components/story/AIStoryGeneratorForm.tsx": "Form that accepts a genre, tone, and optional prompt to trigger AI story generation, polls for the resulting draft, and passes the completed AIGeneratedStory to a parent callback.",
  "frontend/src/components/story/CreateStoryForm.tsx": "Full story creation form that collects title, description, narrative body, category, cover image URL, and an optional audio file, then publishes the story and uploads audio blobs to the backend.",
  "frontend/src/components/story/MiniAudioPlayer.tsx": "Compact inline audio player with play/pause toggle and a seekable progress bar, resolving the audio source via ExternalBlob and displaying elapsed/total time.",
  "frontend/src/components/story/StoryCard.tsx": "Renders a story card with cover image, category badge, stats, a mini audio player, and like/save action buttons, wiring up authentication-gated mutations for liking and saving stories.",
  "frontend/src/context/PlayerContext.tsx": "Provides a React context for managing the global audio player state, exposing the current story, open/close controls, and player visibility.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) via React Query, reinitializing and invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions including story fetching, searching, liking, saving, user profiles, and story drafts.",
  "frontend/src/index.css": "Defines the global CSS for the app including a dark purple/blue OKLCH theme, Tailwind base layers, and custom utility classes for gradients, glass effects, and scrollbar hiding.",
  "frontend/src/lib/recentlyPlayed.ts": "Manages a localStorage-backed list of recently played story IDs, capped at 20 entries, with get and add utility functions.",
  "frontend/src/lib/utils.ts": "Provides shared utility functions for class merging, count/time formatting, and category label and color mapping.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CreateStoryPage.tsx": "Page for creating stories, supporting both manual entry and AI-generated story modes with a toggle; redirects unauthenticated users to a login prompt.",
  "frontend/src/pages/FooterPage.tsx": "Empty placeholder file; the footer is handled by the AppLayout component instead.",
  "frontend/src/pages/HomePage.tsx": "Home page displaying a hero banner, a trending stories section, and an all-stories grid with skeleton loading states.",
  "frontend/src/pages/LibraryPage.tsx": "Library page with tabs for saved stories, user-created stories, and recently played stories; requires authentication to access.",
  "frontend/src/pages/OnboardingPage.tsx": "Landing/onboarding page with a hero background, app branding, feature highlights, and login/explore CTAs.",
  "frontend/src/pages/ProfilePage.tsx": "Profile page showing the user's avatar, bio, story count, and an inline profile edit form; requires authentication.",
  "frontend/src/pages/SearchPage.tsx": "Discover/search page with a debounced search bar, category filter, trending section, and filtered story results grid.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH-based color tokens, typography/container-query plugins, custom fonts, shadows, border radii, and keyframe animations.",
  "project_state.json": "Project state manifest for StoryWave describing the app summary, tech stack, architectural notes, and a list of implemented features with their requirement IDs and versions."
}